{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Task07.ipynb","provenance":[],"collapsed_sections":[],"authorship_tag":"ABX9TyNYMz/vjVl/Wq4T3gnfudVg"},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"3_3OmWdnU0fk"},"source":["# -*- coding: utf-8 -*-\n","\"\"\"Task07.ipynb\n","Automatically generated by Colaboratory.\n","Original file is located at\n","    https://colab.research.google.com/drive/1tV5j-DRcpPtoJGoMj8v2DSqR_9wyXeiE\n","**Task 07: Querying RDF(s)**\n","\"\"\""]},{"cell_type":"code","metadata":{"id":"qO6tYnkDTjwg","executionInfo":{"status":"ok","timestamp":1601123813032,"user_tz":-120,"elapsed":3449,"user":{"displayName":"Carlos Martin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GifFAYwniGCxDatrbO5Jp4xlHWHy6etJpa114ZT7A=s64","userId":"02232819201670537321"}},"outputId":"edbcb4d5-dc03-48d7-d1b4-d78c55cdc65f","colab":{"base_uri":"https://localhost:8080/","height":85}},"source":["!pip install rdflib \n","github_storage = \"https://raw.githubusercontent.com/FacultadInformatica-LinkedData/Curso2020-2021/master/Assignment4\""],"execution_count":11,"outputs":[{"output_type":"stream","text":["Requirement already satisfied: rdflib in /usr/local/lib/python3.6/dist-packages (5.0.0)\n","Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from rdflib) (1.15.0)\n","Requirement already satisfied: isodate in /usr/local/lib/python3.6/dist-packages (from rdflib) (0.6.0)\n","Requirement already satisfied: pyparsing in /usr/local/lib/python3.6/dist-packages (from rdflib) (2.4.7)\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"c9AyD65yU7Tf"},"source":["\"\"\"Leemos el fichero RDF de la forma que lo hemos venido haciendo\"\"\""]},{"cell_type":"code","metadata":{"id":"cMy78k-SU9vc","executionInfo":{"status":"ok","timestamp":1601123816430,"user_tz":-120,"elapsed":876,"user":{"displayName":"Carlos Martin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GifFAYwniGCxDatrbO5Jp4xlHWHy6etJpa114ZT7A=s64","userId":"02232819201670537321"}},"outputId":"c83b94a5-8d25-42d3-d478-c9f807cadba8","colab":{"base_uri":"https://localhost:8080/","height":34}},"source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","g = Graph()\n","g.namespace_manager.bind('ns', Namespace(\"http://somewhere#\"), override=False)\n","g.namespace_manager.bind('vcard', Namespace(\"http://www.w3.org/2001/vcard-rdf/3.0#\"), override=False)\n","g.parse(github_storage+\"/resources/example6.rdf\", format=\"xml\")"],"execution_count":12,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=Nd2299bc788af4e7f9c927ab6f760bfe4 (<class 'rdflib.graph.Graph'>)>"]},"metadata":{"tags":[]},"execution_count":12}]},{"cell_type":"markdown","metadata":{"id":"ZH4BaMnWVCSv"},"source":["\"\"\"**TASK 7.1: List all subclasses of \"Person\" with RDFLib and SPARQL**"]},{"cell_type":"code","metadata":{"id":"RgcNxtQ3VCgD","executionInfo":{"status":"ok","timestamp":1601123823285,"user_tz":-120,"elapsed":922,"user":{"displayName":"Carlos Martin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GifFAYwniGCxDatrbO5Jp4xlHWHy6etJpa114ZT7A=s64","userId":"02232819201670537321"}},"outputId":"7c646def-6b98-4a38-cf8c-d67de03768ef","colab":{"base_uri":"https://localhost:8080/","height":153}},"source":["from rdflib.plugins.sparql import prepareQuery\n","ns = Namespace(\"http://somewhere#\")\n","for s,p,o in g.triples((None, RDFS.subClassOf, ns.Person)):\n","  print(s,p,o)\n","print(\"\\n-------------------these was RDFLib-------------------\\n\")\n","\n","querySPARQL = prepareQuery('''SELECT ?p WHERE { ?p rdfs:subClassOf ns:Person. }''', initNs = { \"rdfs\": RDFS, \"ns\": ns})\n","for z in g.query(querySPARQL):\n","  print(z)\n","print(\"\\n-------------------these was SPARQL-------------------\\n\")"],"execution_count":13,"outputs":[{"output_type":"stream","text":["http://somewhere#Researcher http://www.w3.org/2000/01/rdf-schema#subClassOf http://somewhere#Person\n","\n","-------------------these was RDFLib-------------------\n","\n","(rdflib.term.URIRef('http://somewhere#Researcher'),)\n","\n","-------------------these was SPARQL-------------------\n","\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"UI-r8nfiVCrg"},"source":["**TASK 7.2: List all individuals of \"Person\" with RDFLib and SPARQL (remember the subClasses)**"]},{"cell_type":"code","metadata":{"id":"7OW59e5RVC2e","executionInfo":{"status":"ok","timestamp":1601124361936,"user_tz":-120,"elapsed":897,"user":{"displayName":"Carlos Martin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GifFAYwniGCxDatrbO5Jp4xlHWHy6etJpa114ZT7A=s64","userId":"02232819201670537321"}},"outputId":"b3d4d8b6-9fdd-456f-a517-a116de6d1824","colab":{"base_uri":"https://localhost:8080/","height":221}},"source":["for s,p,o in g.triples((None, RDF.type, ns.Person)):\n","  print(s)\n","for s,p,o in g.triples((None, RDFS.subClassOf, ns.Person)):\n","  for x,y,z in g.triples((None, RDF.type, s)):\n","    print(x)\n","print(\"\\n-------------------these was RDFLib-------------------\\n\")\n","\n","querySPARQL1 = prepareQuery('''SELECT ?p WHERE { { ?p rdf:type ns:Person. } \n","  UNION { ?sc rdfs:subClassOf ns:Person. ?p rdf:type ?sc } }''',\n","  initNs = { \"rdfs\": RDFS, \"ns\": ns}\n",")\n","for z in g.query(querySPARQL1):\n","  print(z)\n","print(\"\\n-------------------these was SPARQL-------------------\\n\")"],"execution_count":15,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith\n","http://somewhere#SaraJones\n","http://somewhere#JaneSmith\n","\n","-------------------these was RDFLib-------------------\n","\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'),)\n","(rdflib.term.URIRef('http://somewhere#SaraJones'),)\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'),)\n","\n","-------------------these was SPARQL-------------------\n","\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"KdH5wa9WVDCO"},"source":["**TASK 7.3: List all individuals of \"Person\" and all their properties including their class with RDFLib and SPARQL**\"\"\""]},{"cell_type":"code","metadata":{"id":"8LG73B0fVDMv","executionInfo":{"status":"ok","timestamp":1601125157950,"user_tz":-120,"elapsed":831,"user":{"displayName":"Carlos Martin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GifFAYwniGCxDatrbO5Jp4xlHWHy6etJpa114ZT7A=s64","userId":"02232819201670537321"}},"outputId":"2e294e8f-f510-4d12-e754-0fb5872e4cd1","colab":{"base_uri":"https://localhost:8080/","height":649}},"source":["for s,p,o in g.triples((None, RDF.type, ns.Person)):\n","  for x,y,z in g.triples((s, None, None)):\n","      print(x,y,z)\n","print(\"\\n************all individual Person************\\n\")\n","for s,p,o in g.triples((None, RDFS.subClassOf, ns.Person)):\n","  for x,y,z in g.triples((None, RDF.type, s)):\n","    for a,b,c in g.triples((x, None, None)):\n","      print(a,b,c)\n","print(\"\\n************Person properties************\\n\")\n","print(\"\\n-------------------these was RDFLib-------------------\\n\")\n","\n","querySPARQL2 = prepareQuery('''\n","  SELECT ?s ?o ?p WHERE { { ?s rdf:type ns:Person. ?s ?o ?p }\n","  UNION { ?s rdf:type ?x. ?s ?o ?p. ?x rdfs:subClassOf ns:Person } }''',\n","  initNs = { \"rdfs\": RDFS,\"rdf\": RDF, \"ns\": ns}\n",")\n","\n","for z in g.query(querySPARQL2):\n","  print(z)\n","print(\"\\n-------------------these was SPARQL-------------------\\n\")"],"execution_count":17,"outputs":[{"output_type":"stream","text":["http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","\n","************all individual Person************\n","\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n","\n","************Person properties************\n","\n","\n","-------------------these was RDFLib-------------------\n","\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://somewhere#Person'))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.Literal('John Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.Literal('John', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.Literal('Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.Literal('Sara', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://somewhere#Person'))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.Literal('Sara Jones', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.Literal('Jones', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.Literal('Jane', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.Literal('jane Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.Literal('Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://somewhere#Researcher'))\n","\n","-------------------these was SPARQL-------------------\n","\n"],"name":"stdout"}]}]}