{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Task07.ipynb","provenance":[],"collapsed_sections":[]},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"nOOPLCHF7hLB"},"source":["**Task 07: Querying RDF(s)**"]},{"cell_type":"code","metadata":{"id":"Yl9npCt8n6m-","executionInfo":{"status":"ok","timestamp":1601132127744,"user_tz":-120,"elapsed":4702,"user":{"displayName":"Belén Ferrón","photoUrl":"","userId":"09177010877640653442"}},"outputId":"df6f2c12-ab49-4fa8-8070-6f395d151222","colab":{"base_uri":"https://localhost:8080/","height":207}},"source":["!pip install rdflib \n","github_storage = \"https://raw.githubusercontent.com/FacultadInformatica-LinkedData/Curso2020-2021/master/Assignment4\""],"execution_count":1,"outputs":[{"output_type":"stream","text":["Collecting rdflib\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/d0/6b/6454aa1db753c0f8bc265a5bd5c10b5721a4bb24160fb4faf758cf6be8a1/rdflib-5.0.0-py3-none-any.whl (231kB)\n","\u001b[K     |████████████████████████████████| 235kB 2.8MB/s \n","\u001b[?25hRequirement already satisfied: pyparsing in /usr/local/lib/python3.6/dist-packages (from rdflib) (2.4.7)\n","Collecting isodate\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/9b/9f/b36f7774ff5ea8e428fdcfc4bb332c39ee5b9362ddd3d40d9516a55221b2/isodate-0.6.0-py2.py3-none-any.whl (45kB)\n","\u001b[K     |████████████████████████████████| 51kB 5.3MB/s \n","\u001b[?25hRequirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from rdflib) (1.15.0)\n","Installing collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.0 rdflib-5.0.0\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"XY7aPc86Bqoo"},"source":["Leemos el fichero RDF de la forma que lo hemos venido haciendo"]},{"cell_type":"code","metadata":{"id":"9ERh415on7kF","executionInfo":{"status":"ok","timestamp":1601132128148,"user_tz":-120,"elapsed":5064,"user":{"displayName":"Belén Ferrón","photoUrl":"","userId":"09177010877640653442"}},"outputId":"1402882b-f171-402b-d91e-4d5d35344a8c","colab":{"base_uri":"https://localhost:8080/","height":34}},"source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","g = Graph()\n","g.namespace_manager.bind('ns', Namespace(\"http://somewhere#\"), override=False)\n","g.namespace_manager.bind('vcard', Namespace(\"http://www.w3.org/2001/vcard-rdf/3.0#\"), override=False)\n","g.parse(github_storage+\"/resources/example6.rdf\", format=\"xml\")"],"execution_count":2,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=N207e65bdf4b542d18bc65565ddac3c1d (<class 'rdflib.graph.Graph'>)>"]},"metadata":{"tags":[]},"execution_count":2}]},{"cell_type":"markdown","metadata":{"id":"qp1oe2Eddsvo"},"source":["**TASK 7.1: List all subclasses of \"Person\" with RDFLib and SPARQL**"]},{"cell_type":"code","metadata":{"id":"P9YY8lFmi6RL","executionInfo":{"status":"ok","timestamp":1601134786150,"user_tz":-120,"elapsed":1029,"user":{"displayName":"Belén Ferrón","photoUrl":"","userId":"09177010877640653442"}},"outputId":"06e8b030-9406-4988-ad0e-1be8efd4c4d5","colab":{"base_uri":"https://localhost:8080/","height":139}},"source":["#For this part since I am asked to list ALL subclasses, I will try to show even the subclasses of subclasses of the Person Class.\n","base = Namespace(\"http://somewhere#\")\n","print(\"Subclasses list using RDFLib\")\n","for s,p,o in g.triples((None, RDFS.subClassOf, base.Person)):\n","  print(s,\"is a subclass of Person\")\n","for s,p,o in g.triples((None, RDFS.subClassOf, base.Person)):\n","  for s0,p0,o0 in g.triples((None, RDFS.subClassOf, s)):\n","    print(s0,\"is a subclass of a subclass of Person\")\n","#I'll use the rdfs:subClass* to ask for all the possible subclasses of Person\n","qres = g.query(\n","\"\"\"SELECT DISTINCT ?subClass ?p ?o\n","WHERE {\n","?subClass rdfs:subClassOf* <http://somewhere#Person>.\n","?subClass ?p ?o filter(?p not in ( rdf:type ))\n","}\"\"\")\n","print(\"Subclasses list using SPARQL\")\n","for row in qres:\n","  print(\"%s is a subclass of Person\" % row)\n"],"execution_count":44,"outputs":[{"output_type":"stream","text":["Subclasses list using RDFLib\n","http://somewhere#Researcher is a subclass of Person\n","http://somewhere#PhDstudent is a subclass of a subclass of Person\n","Subclasses list using SPARQL\n","http://somewhere#Researcher http://www.w3.org/2000/01/rdf-schema#subClassOf http://somewhere#Person is a subclass of Person\n","http://somewhere#PhDstudent http://www.w3.org/2000/01/rdf-schema#subClassOf http://somewhere#Researcher is a subclass of Person\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"gM3DASkTQQ5Y"},"source":["**TASK 7.2: List all individuals of \"Person\" with RDFLib and SPARQL (remember the subClasses)**\n"]},{"cell_type":"code","metadata":{"id":"nBA04dp2i7Bs","executionInfo":{"status":"ok","timestamp":1601134406562,"user_tz":-120,"elapsed":1293,"user":{"displayName":"Belén Ferrón","photoUrl":"","userId":"09177010877640653442"}},"outputId":"a2553ea8-1640-453c-b0fe-ae46ae3928cc","colab":{"base_uri":"https://localhost:8080/","height":153}},"source":["print(\"Individuals list using RDFLib\")\n","for s,p,o in g.triples((None, RDFS.subClassOf, base.Person)):\n","  for s0,p0,o0 in g.triples((None,RDF.type,s)):\n","    print(s0,\"is an individual of Person\")\n","for s,p,o in g.triples((None, RDF.type,base.Person)):\n","  print(s,\"is an individual of Person\")\n","print(\"Individuals list using SPARQL\")\n","qres = g.query(\n","\"\"\"SELECT DISTINCT ?individual\n","WHERE {\n","  {?person rdfs:subClassOf* <http://somewhere#Person> .\n","  ?individual a ?person. } UNION\n","  {?individual  a <http://somewhere#Person>.}\n","}\"\"\")\n","for row in qres:\n","  print(\"%s is an individual of Person\" % row)"],"execution_count":35,"outputs":[{"output_type":"stream","text":["Individuals list using RDFLib\n","http://somewhere#JaneSmith is an individual of Person\n","http://somewhere#SaraJones is an individual of Person\n","http://somewhere#JohnSmith is an individual of Person\n","Individuals list using SPARQL\n","http://somewhere#SaraJones is an individual of Person\n","http://somewhere#JohnSmith is an individual of Person\n","http://somewhere#JaneSmith is an individual of Person\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"MXBqtBkJd22I"},"source":["**TASK 7.3: List all individuals of \"Person\" and all their properties including their class with RDFLib and SPARQL**\n"]},{"cell_type":"code","metadata":{"id":"OeTlkBw6i7nf","executionInfo":{"status":"ok","timestamp":1601134356795,"user_tz":-120,"elapsed":1178,"user":{"displayName":"Belén Ferrón","photoUrl":"","userId":"09177010877640653442"}},"outputId":"54bb69ac-f199-4884-8ece-1caa7d170df1","colab":{"base_uri":"https://localhost:8080/","height":459}},"source":["print(\"Individuals and properties list using RDFLib\")\n","for s,p,o in g.triples((None, RDFS.subClassOf, base.Person)):\n","  for s0,p0,o0 in g.triples((None,RDF.type,s)):\n","    for s1,p1,o1 in g.triples((s0,None,None)):\n","      print(s1,p1,o1)\n","for s,p,o in g.triples((None,RDF.type,base.Person)):\n","  for s0,p0,o0 in g.triples((s,None,None)):\n","    print(s0,p0,o0)\n","print(\"Individuals and properties list using SPARQL\")\n","qres = g.query(\n","\"\"\"SELECT DISTINCT ?individual ?prop ?value\n","WHERE {\n","  {?person rdfs:subClassOf* <http://somewhere#Person>.\n","   ?individual a ?person.\n","   ?individual ?prop ?value.\n","   } UNION\n","  {?individual  a <http://somewhere#Person>.\n","  ?individual ?prop ?value.}\n","}\"\"\")\n","for row in qres:\n","  print(\"%s %s %s\" % row)"],"execution_count":34,"outputs":[{"output_type":"stream","text":["Individuals and properties list using RDFLib\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","Individuals and properties list using SPARQL\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n"],"name":"stdout"}]}]}