Query 5:

PREFIX ex: <http://dbpedia.org/ontology/>

SELECT DISTINCT ?p count(?y)
WHERE{
?x rdf:type ex:Politician .
?x ?p ?y
FILTER (?p != rdf:type)
}
LIMIT 100

Resultados:

p 	callret-1
http://es.dbpedia.org/property/período 	

15552

http://es.dbpedia.org/property/subtítulo 	

968

http://dbpedia.org/ontology/wikiPageRevisionID 	

24272

http://es.dbpedia.org/property/afiliaciones 	

1417

http://es.dbpedia.org/property/conocidoPor 	

42

http://es.dbpedia.org/property/isbn 	

3074

http://es.dbpedia.org/property/url 	

5505

http://es.dbpedia.org/property/vicegobernador 	

526

http://es.dbpedia.org/property/facebook 	

377

http://es.dbpedia.org/property/idioma 	

930

http://es.dbpedia.org/property/área 	

62

http://es.dbpedia.org/property/etnia 	

60

http://es.dbpedia.org/property/pareja 	

103

http://es.dbpedia.org/property/title 	

392

http://es.dbpedia.org/property/periodo 	

19

http://es.dbpedia.org/property/otrosnombres 	

19

http://es.dbpedia.org/property/descripción 	

93

http://es.dbpedia.org/property/3data 	

126

http://es.dbpedia.org/property/empleos 	

42

http://es.dbpedia.org/property/jefe 	

151

http://es.dbpedia.org/property/selecciónNacionalPeríodo 	

2

http://es.dbpedia.org/property/2a 	

31

http://es.dbpedia.org/property/3ps 	

1

http://es.dbpedia.org/property/chapter 	

3

http://es.dbpedia.org/property/estado 	

21

http://es.dbpedia.org/property/others 	

4

http://es.dbpedia.org/property/nota 	

4

http://es.dbpedia.org/property/teniente 	

53

http://es.dbpedia.org/property/tipo 	

17

http://es.dbpedia.org/property/madre 	

19

http://es.dbpedia.org/property/lugarDeEntierro 	

15

http://es.dbpedia.org/property/colwidth 	

3

http://es.dbpedia.org/property/porcentajeParticipación 	

2

http://es.dbpedia.org/property/alineaciónTexto 	

15

http://es.dbpedia.org/property/peso 	

7

http://es.dbpedia.org/property/birthname 	

2

http://es.dbpedia.org/property/portal 	

19

http://es.dbpedia.org/property/tamañoEscudo 	

3

http://es.dbpedia.org/property/disoluciónDeLaRevuelta 	

1

http://es.dbpedia.org/property/encabezado 	

3

http://es.dbpedia.org/property/coronación 	

1

http://es.dbpedia.org/property/listaextra 	

2

http://es.dbpedia.org/property/raza 	

4

http://es.dbpedia.org/property/direction 	

3

http://es.dbpedia.org/property/colección 	

11

http://es.dbpedia.org/property/successor 	

3

http://es.dbpedia.org/property/voy 	

1

http://es.dbpedia.org/property/appointed 	

1

http://es.dbpedia.org/property/ended 	

1

http://es.dbpedia.org/property/exCargo 	

1

http://es.dbpedia.org/property/rom 	

1

http://es.dbpedia.org/property/escritor 	

2

http://es.dbpedia.org/property/tiempo 	

12

http://es.dbpedia.org/property/ocpación 	

1

http://es.dbpedia.org/property/rangoMilitar 	

5

http://es.dbpedia.org/property/oleft 	

1

http://es.dbpedia.org/property/partidPolítico 	

1

http://es.dbpedia.org/property/deadurl 	

4

http://es.dbpedia.org/property/page 	

7

http://es.dbpedia.org/property/mostrarNombres 	

7

http://es.dbpedia.org/property/presidenteDelBancoCentralDelUruguay 	

1

http://es.dbpedia.org/property/lider 	

1

http://es.dbpedia.org/property/descripciónImagen 	

1

http://es.dbpedia.org/property/eduacación 	

1

http://es.dbpedia.org/property/years 	

2

http://es.dbpedia.org/property/supervisoraDoctoral 	

1

http://es.dbpedia.org/property/gradoAcadémico 	

1

http://es.dbpedia.org/property/en 	

1

http://es.dbpedia.org/property/motivo 	

1

http://es.dbpedia.org/property/educadoEn 	

3

http://es.dbpedia.org/property/fechanace 	

1

http://es.dbpedia.org/property/causaDeLaMuerte 	

2

http://es.dbpedia.org/property/branch 	

1

http://es.dbpedia.org/property/comidaFavorita 	

1

http://es.dbpedia.org/property/labelSize 	

1

http://es.dbpedia.org/property/pos 	

2

http://es.dbpedia.org/property/wikiqoutes 	

1

http://es.dbpedia.org/property/premiosAtv 	

1

http://es.dbpedia.org/property/distrit 	

1

http://es.dbpedia.org/property/influyóEn 	

3

http://es.dbpedia.org/property/dimensiones 	

1

http://es.dbpedia.org/property/fechaDeFallecimietno 	

1

http://es.dbpedia.org/property/presidentaMunicipalDeTultitlán 	

1

http://es.dbpedia.org/property/última 	

2

http://es.dbpedia.org/property/vicedirectora 	

1

http://es.dbpedia.org/property/servicioMilitary 	

2

http://es.dbpedia.org/property/sitoweb 	

1

http://es.dbpedia.org/property/sufijohonorífico 	

1

http://es.dbpedia.org/property/abr 	

2

http://es.dbpedia.org/property/encurso 	

1

http://es.dbpedia.org/property/carg 	

1

http://es.dbpedia.org/property/naconalidad 	

1

http://es.dbpedia.org/property/vástago 	

1

http://es.dbpedia.org/property/general 	

1

http://es.dbpedia.org/property/cónyuge(...2014)_ 	

1

http://es.dbpedia.org/property/vicepresidente 	

1216

http://www.w3.org/ns/prov#wasDerivedFrom 	

24272

http://www.w3.org/2002/07/owl#sameAs 	

9928

http://www.w3.org/2007/05/powder-s#describedby 	

1549

http://es.dbpedia.org/property/año 	

9155