{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Task07.ipynb","provenance":[],"collapsed_sections":[]},"kernelspec":{"name":"python3","display_name":"Python 3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"nOOPLCHF7hLB"},"source":["**Task 07: Querying RDF(s)**"]},{"cell_type":"code","metadata":{"id":"Yl9npCt8n6m-","executionInfo":{"status":"ok","timestamp":1601227444176,"user_tz":-120,"elapsed":4716,"user":{"displayName":"Endurance","photoUrl":"","userId":"12480063966155098819"}},"outputId":"a8f5df57-227e-4151-e36e-e27b07cc0e48","colab":{"base_uri":"https://localhost:8080/","height":185}},"source":["!pip install rdflib \n","github_storage = \"https://raw.githubusercontent.com/FacultadInformatica-LinkedData/Curso2020-2021/master/Assignment4\""],"execution_count":null,"outputs":[{"output_type":"stream","text":["Collecting rdflib\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/d0/6b/6454aa1db753c0f8bc265a5bd5c10b5721a4bb24160fb4faf758cf6be8a1/rdflib-5.0.0-py3-none-any.whl (231kB)\n","\u001b[K     |████████████████████████████████| 235kB 9.8MB/s \n","\u001b[?25hRequirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from rdflib) (1.15.0)\n","Collecting isodate\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/9b/9f/b36f7774ff5ea8e428fdcfc4bb332c39ee5b9362ddd3d40d9516a55221b2/isodate-0.6.0-py2.py3-none-any.whl (45kB)\n","\u001b[K     |████████████████████████████████| 51kB 6.6MB/s \n","\u001b[?25hRequirement already satisfied: pyparsing in /usr/local/lib/python3.6/dist-packages (from rdflib) (2.4.7)\n","Installing collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.0 rdflib-5.0.0\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"XY7aPc86Bqoo"},"source":["Leemos el fichero RDF de la forma que lo hemos venido haciendo"]},{"cell_type":"code","metadata":{"id":"9ERh415on7kF","executionInfo":{"status":"ok","timestamp":1601229864594,"user_tz":-120,"elapsed":847,"user":{"displayName":"Endurance","photoUrl":"","userId":"12480063966155098819"}},"outputId":"f4c54907-7f25-4517-c5e1-f789250643bc","colab":{"base_uri":"https://localhost:8080/","height":34}},"source":["from rdflib import Graph, Namespace, Literal\n","from rdflib.namespace import RDF, RDFS\n","g = Graph()\n","g.namespace_manager.bind('ns', Namespace(\"http://somewhere#\"), override=False)\n","g.namespace_manager.bind('vcard', Namespace(\"http://www.w3.org/2001/vcard-rdf/3.0#\"), override=False)\n","g.parse(github_storage+\"/resources/example6.rdf\", format=\"xml\")"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=Nf125723b673b42e0b3738283c810f051 (<class 'rdflib.graph.Graph'>)>"]},"metadata":{"tags":[]},"execution_count":42}]},{"cell_type":"markdown","metadata":{"id":"qp1oe2Eddsvo"},"source":["**TASK 7.1: List all subclasses of \"Person\" with RDFLib and SPARQL**"]},{"cell_type":"code","metadata":{"id":"h6U8jXa_mX75","executionInfo":{"status":"ok","timestamp":1601234958685,"user_tz":-120,"elapsed":941,"user":{"displayName":"Endurance","photoUrl":"","userId":"12480063966155098819"}},"outputId":"20c757fd-edaf-4d66-b114-eea4824c8a57","colab":{"base_uri":"https://localhost:8080/","height":50}},"source":["for s,p,o in g.triples((None,RDFS.subClassOf,ns.Person)):\n","  print(s)\n","  for s1,p1,o1 in g.triples((None,RDFS.subClassOf,s)):\n","      print(s1)"],"execution_count":131,"outputs":[{"output_type":"stream","text":["http://somewhere#Researcher\n","http://somewhere#PhDstudent\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"abk1ORcjqU2p","executionInfo":{"status":"ok","timestamp":1601235080229,"user_tz":-120,"elapsed":749,"user":{"displayName":"Endurance","photoUrl":"","userId":"12480063966155098819"}},"outputId":"eba2e901-2c92-4311-81b6-5db9120f4f31","colab":{"base_uri":"https://localhost:8080/","height":50}},"source":["from rdflib.plugins.sparql import prepareQuery\n","q1 = prepareQuery('''\n","  SELECT \n","    ?s\n","  WHERE { \n","    ?s (rdfs:subClassOf/rdfs:subClassOf*) ns:Person. \n","  }\n","  ''',\n","  initNs = { \"rdfs\": RDFS, \"ns\": ns}\n",")\n","\n","for r in g.query(q1):\n","  print(r)"],"execution_count":136,"outputs":[{"output_type":"stream","text":["(rdflib.term.URIRef('http://somewhere#Researcher'),)\n","(rdflib.term.URIRef('http://somewhere#PhDstudent'),)\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"gM3DASkTQQ5Y"},"source":["**TASK 7.2: List all individuals of \"Person\" with RDFLib and SPARQL (remember the subClasses)**\n"]},{"cell_type":"code","metadata":{"id":"S95i4sGOsGlk","executionInfo":{"status":"ok","timestamp":1601235024062,"user_tz":-120,"elapsed":763,"user":{"displayName":"Endurance","photoUrl":"","userId":"12480063966155098819"}},"outputId":"85cedb34-ff0e-4aa0-d4fa-09ae05063196","colab":{"base_uri":"https://localhost:8080/","height":67}},"source":["q2 = prepareQuery('''\n","  SELECT distinct ?Person\n","  WHERE {\n","    {?PClass (rdfs:subClassOf/rdfs:subClassOf*) ns:Person}\n","    {?Person rdf:type ?PClass}\n","    UNION\n","    {?Person rdf:type ns:Person}\n","  }\n","  ''',\n","  initNs = { \"ns\": ns}\n",")\n","\n","for r in g.query(q2):\n","  print(r)"],"execution_count":133,"outputs":[{"output_type":"stream","text":["(rdflib.term.URIRef('http://somewhere#JaneSmith'),)\n","(rdflib.term.URIRef('http://somewhere#SaraJones'),)\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'),)\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"Q85w02cSq22F","executionInfo":{"status":"ok","timestamp":1601232193878,"user_tz":-120,"elapsed":786,"user":{"displayName":"Endurance","photoUrl":"","userId":"12480063966155098819"}},"outputId":"22a1990f-b017-493d-ad95-b46f8225e1f3","colab":{"base_uri":"https://localhost:8080/","height":67}},"source":["for s,p,o in g.triples((None,RDF.type,ns.Person)):\n","  print(s)\n","for s,p,o in g.triples((None,RDFS.subClassOf,ns.Person)):\n","  for(s,p,o2) in g.triples((None,RDF.type,s)):\n","    print(s)"],"execution_count":null,"outputs":[{"output_type":"stream","text":["http://somewhere#SaraJones\n","http://somewhere#JohnSmith\n","http://somewhere#JaneSmith\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"USDbeKZA1e3W"},"source":[""]},{"cell_type":"markdown","metadata":{"id":"MXBqtBkJd22I"},"source":["**TASK 7.3: List all individuals of \"Person\" and all their properties including their class with RDFLib and SPARQL**\n"]},{"cell_type":"code","metadata":{"id":"7ucn7rFV4IL6","executionInfo":{"status":"ok","timestamp":1601235051058,"user_tz":-120,"elapsed":950,"user":{"displayName":"Endurance","photoUrl":"","userId":"12480063966155098819"}},"outputId":"7b70bbea-d92e-4a56-f869-b9d911d0b469","colab":{"base_uri":"https://localhost:8080/","height":238}},"source":["q2 = prepareQuery('''\n","  SELECT distinct ?Person ?P ?O\n","  WHERE {\n","    {?PClass (rdfs:subClassOf/rdfs:subClassOf*) ns:Person}\n","    {?Person rdf:type ?PClass}\n","    UNION\n","    {?Person rdf:type ns:Person}\n","    {?Person ?P ?O}\n","  }\n","  ''',\n","  initNs = { \"ns\": ns}\n",")\n","\n","for r in g.query(q2):\n","  print(r)"],"execution_count":135,"outputs":[{"output_type":"stream","text":["(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.Literal('Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.Literal('jane Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.Literal('Jane', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JaneSmith'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://somewhere#Researcher'))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.Literal('Sara Jones', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://somewhere#Person'))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.Literal('Sara', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#SaraJones'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.Literal('Jones', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given'), rdflib.term.Literal('John', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family'), rdflib.term.Literal('Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN'), rdflib.term.Literal('John Smith', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')))\n","(rdflib.term.URIRef('http://somewhere#JohnSmith'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://somewhere#Person'))\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"suVomtbn_exq","executionInfo":{"status":"ok","timestamp":1601234539144,"user_tz":-120,"elapsed":890,"user":{"displayName":"Endurance","photoUrl":"","userId":"12480063966155098819"}},"outputId":"c8bf0a6d-5bbb-4683-fb2e-829209c42219","colab":{"base_uri":"https://localhost:8080/","height":238}},"source":["for s,p,o in g.triples((None,RDF.type,ns.Person)):\n","  for s,p,o in g.triples((s,None,None)):\n","    print(s,p,o)\n","for s,p,o in g.triples((None,RDFS.subClassOf,ns.Person)):\n","  for(s,p,o) in g.triples((None,RDF.type,s)):\n","    for(s,p,o) in g.triples((s,None,None)):\n","      print(s,p,o)"],"execution_count":null,"outputs":[{"output_type":"stream","text":["http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Sara\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN Sara Jones\n","http://somewhere#SaraJones http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#SaraJones http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Jones\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given John\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JohnSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN John Smith\n","http://somewhere#JohnSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Person\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Family Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/FN jane Smith\n","http://somewhere#JaneSmith http://somewhere#http://www.w3.org/2001/vcard-rdf/3.0/Given Jane\n","http://somewhere#JaneSmith http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://somewhere#Researcher\n"],"name":"stdout"}]}]}